---
slug: "kuzu-0.6.0-release"
title: "Kùzu 0.6.0 Release"
description: "Release announcement for Kùzu 0.6.0"
pubDate: "August 15 2024"
heroImage: "/img/default.png"
categories: ["release"]
authors: ["team"]
tags: ["cypher"]
---

This release comes with several bug fixes and a much awaited feature: in-memory mode for Kùzu to quickly create temporary and in-memory databases!
Please see the [release notes](https://github.com/kuzudb/kuzu/releases/tag/v0.6.0) for the bugfixes. In the rest of this post,
we give an overview of the in-memory Kùzu feature and provide some insights about the performance benefits to expect
when using Kùzu in in-memory mode.

## In-memory Mode
Kùzu now supports both on-disk and in-memory modes. 
As you create your databases, if you do not specify a database path or specify it as `:memory:`, Kùzu will be opened under **in-memory** mode.
The main differences of using in-memory mode compared to the on-disk mode are:
- There are **no writes to the write-ahead-log (WAL) during transactions**, so no data is persisted to disk (so `CHECKPOINT` will do nothing); 
and all data is lost when the process finishes.

Importantly, your databases under in-memory mode are temporary, which can be useful in many scenarios that require
performing quick graph querying and analysis on subsets of records, without the need to persist the data.

Due to above differences, in-memory mode and on-disk mode can present different performance characteristics.
The following table shows performance numbers of COPY of the LDBC 100 `Comment` table, 
1M insertions (each insert of a node is an auto-transaction) on a node table,
full table scan over `Comment`, and a two hop joins over the LDBC 100 `Knows` table.

All experiments are done on a server with 384GB RAM, 2TB SSD, and 2 Intel Xeon Platinum 8175M CPUs.

```cypher
// COPY
COPY Comment FROM 'ldbc/ldbc-100/csv/comment_0_0.csv' (DELIM="|", HEADER=true);
// Insert
CREATE NODE TABLE nodeT(id INT64, name STRING, age INT64, net_worth FLOAT, PRIMARY KEY (id));
// Pass each record's values as parameters as an individual transaction
CREATE (:nodeT {id: $id, name: $name, age: $age, net_worth: $net_worth})
// Scan
MATCH (c:Comment) RETURN MIN(c.ID), MIN(c.creationDate), MIN(c.locationIP), MIN(c.browserUsed), MIN(c.content), MIN(c.length);
// 2-hop Join
MATCH (a:Person)-[:knows]->(b:Person)-[:knows]->(c:Person) RETURN MIN(a.birthday), MIN(b.birthday), MIN(c.birthday);
```

| mode       |        on-disk (ms)       |     in-mem (ms)   |
| ---------- | ------------------------- | ----------------- |
| COPY       |     34586                 | 14798             |
| Insert     | 79313                     | 47814             |
| Scan       | 5330 (cold) / 1801 (warm) | 1896              |
| 2-hop Join |  950 (cold) / 899 (warm)  | 904               |

The key takeaways are:
- The performance of COPY and large scans during cold runs are much improved (from 34.5s to 14.7s in this experiment) under the in-memory mode compared to the on-disk mode. 
This is due to avoiding all disk I/Os that the on-disk mode has to do to persist the data.
- Similarly, the performance of insertions is greatly improved (from 79.3s to 47.8s in this experiment) due to no writes to the WAL, which involves writing and syncing the disk file.
- Scans: ``Cold'' scans, i.e., the initial scans that are done when the database starts and the buffer manager is empty also improve significantly (from 5.3s to 1.8s). For warm scans, the performance is empty.   
- For large scans during warm runs, the performance difference between the two modes is neligible (*1896ms vs. 1801ms*), since the required pages are already cached in the buffer manager.
- For 2-hop joins, where the performance bottleneck is in the joins and not the scans, thus performance difference is small in both cold and warm runs of the query.

Overall, you can expect the in-memory mode to improve the performance of your data ingestion pipelines, such as a COPY statement or
your write transaction-heavy workloads. You can also expect visible performance improvements if you are running a query only once before
closing your database. Scenarios where you only need a temporary database to run a few queries, a few times
are where you can expect good performance benefits using in-memory mode.

## Closing Marks
The in-memory feature is the first of many more that we have in our upcoming roadmap for Kùzu. Many users had asked for [this feature](https://github.com/kuzudb/kuzu/issues/1816), so we hope it simplifies and possibly speeds up some of your workloads.
See the documentation [here](xxx) for more details of how to create an in-memory database. Try out the new version and its remaining features, and come over to our Discord 
channel to give us your feedback!